# Introduction to Python  

## Pandas Intro

Some examples from [here](https://towardsdatascience.com/40-examples-to-master-pandas-c69d058f434e)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
%matplotlib inline

In [2]:
datapath = "../Data/"

## Pandas Data Structures: [Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Creating Series

In [3]:
obj = pd.Series([4, 12, -5, 3, 5])
obj

0     4
1    12
2    -5
3     3
4     5
dtype: int64

In [4]:
#dir(obj)

Exporting to Numpy array

In [5]:
obj.values

array([ 4, 12, -5,  3,  5])

Examining the index object

In [6]:
obj.index

RangeIndex(start=0, stop=5, step=1)

Redefining the index

In [7]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob        4
Steve     12
Jeff      -5
Ryan       3
Fernie     5
dtype: int64

Creating series and passing the inidex as parameter

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

Slicing and accessing elements in the series

In [9]:
obj2['c']

3

In [10]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

Slicing using boolean expressions

In [11]:
obj2[obj2 < 0]

a   -5
dtype: int64

Scalar operations with the series

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Creating Series from dictionaries

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

isnull() and notnull() methods

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj3.add(obj4, fill_value=10)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah            5010.0
dtype: float64

In [19]:
obj4.name = 'Population'
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

## Pandas Data Structures: [Date Time Range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html)

Specify start and end, with the default daily frequency.

In [20]:
ts_idx1 = pd.date_range(start='1/1/2018', end='1/08/2018')
ts_idx1

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

Specify start and periods, the number of periods (days).

In [21]:
ts_idx2 = pd.date_range("20160101", periods=10, freq='D')
ts_idx2

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

Specify end and periods, the number of periods (days).

In [22]:
ts_idx3 = pd.date_range(end='1/1/2018', periods=8)
ts_idx3

DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
               '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
              dtype='datetime64[ns]', freq='D')

Specify start, end, and periods; the frequency is generated automatically (linearly spaced).

In [23]:
ts_idx4 = pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
ts_idx4

DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
               '2018-04-27 00:00:00'],
              dtype='datetime64[ns]', freq=None)

Other parameters

In [24]:
pd.date_range(start='1/1/2018', periods=5, freq='M')

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')

In [25]:
pd.date_range(start='1/1/2018', periods=5, freq='3M')

DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
               '2019-01-31'],
              dtype='datetime64[ns]', freq='3M')

In [26]:
pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')

DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
               '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
               '2018-01-05 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Tokyo]', freq='D')

In [27]:
pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'], dtype='datetime64[ns]', freq='D')

In [29]:
pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

## Pandas Data Structures: [Dataframe](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html)

Creating Dataframe from a dictionary of lists

In [30]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [31]:
#dir(frame)

In [32]:
print(type(frame))

<class 'pandas.core.frame.DataFrame'>

In [33]:
print(type(frame['state']))

<class 'pandas.core.series.Series'>

Specifying the names of columns

In [34]:
d = pd.DataFrame(data, columns=['year', 'state', 'pop'])
d

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

Making a column as the index

In [35]:
d.set_index('year', inplace=True, drop=False)
d

      year   state  pop
year
2000  2000    Ohio  1.5
2001  2001    Ohio  1.7
2002  2002    Ohio  3.6
2001  2001  Nevada  2.4
2002  2002  Nevada  2.9

Dropping a column

In [36]:
d.drop('year', axis=1, inplace=True)
d

       state  pop
year
2000    Ohio  1.5
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

Dropping one or some lines

In [37]:
d.drop(2000, axis=0, inplace=False)
d

       state  pop
year
2000    Ohio  1.5
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

In [38]:
d.drop(2000, axis=0, inplace=True)
d

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

Slicing by column / index

In [39]:
d['pop']

year
2001    1.7
2002    3.6
2001    2.4
2002    2.9
Name: pop, dtype: float64

In [40]:
d.loc[:,'pop']

year
2001    1.7
2002    3.6
2001    2.4
2002    2.9
Name: pop, dtype: float64

In [41]:
d.loc[2001]

       state  pop
year
2001    Ohio  1.7
2001  Nevada  2.4

In [42]:
d.loc[[2001,2002], ["state", "pop"]]

       state  pop
year
2001    Ohio  1.7
2001  Nevada  2.4
2002    Ohio  3.6
2002  Nevada  2.9

In [43]:
d.iloc[[0,1],[1]]

      pop
year
2001  1.7
2002  3.6

In [44]:
d.iloc[0:3,[0,1]]

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4

Accessing index and columns objects

In [45]:
d.index

Int64Index([2001, 2002, 2001, 2002], dtype='int64', name='year')

In [46]:
d.columns

Index(['state', 'pop'], dtype='object')

Using alternate notation to access columns as a property

In [47]:
d['state']

year
2001      Ohio
2002      Ohio
2001    Nevada
2002    Nevada
Name: state, dtype: object

In [48]:
d.state

year
2001      Ohio
2002      Ohio
2001    Nevada
2002    Nevada
Name: state, dtype: object

Slicing with boolean conditions (&, |, ==, !=)

In [49]:
d = d[(d["state"] != 'Nevada') | (d.index != 2002)]
d

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4

Creating Dataframes from existing structures

In [50]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

Creating new column

In [51]:
frame2['new'] = 13
frame2

       year   state  pop debt  new
one    2000    Ohio  1.5  NaN   13
two    2001    Ohio  1.7  NaN   13
three  2002    Ohio  3.6  NaN   13
four   2001  Nevada  2.4  NaN   13
five   2002  Nevada  2.9  NaN   13

In [52]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
new        13
Name: three, dtype: object

In [53]:
frame2.loc['three', 'pop']

3.6

In [54]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
new        13
Name: three, dtype: object

In [55]:
frame2.iloc[2,1]

'Ohio'

In [56]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [57]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5  16.5   13
two    2001    Ohio  1.7  16.5   13
three  2002    Ohio  3.6  16.5   13
four   2001  Nevada  2.4  16.5   13
five   2002  Nevada  2.9  16.5   13

In [58]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5   0.0   13
two    2001    Ohio  1.7   1.0   13
three  2002    Ohio  3.6   2.0   13
four   2001  Nevada  2.4   3.0   13
five   2002  Nevada  2.9   4.0   13

Creating a column from a series

In [59]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5   NaN   13
two    2001    Ohio  1.7  -1.2   13
three  2002    Ohio  3.6   NaN   13
four   2001  Nevada  2.4  -1.5   13
five   2002  Nevada  2.9  -1.7   13

Creating a column from a bolean expression

In [60]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  new  eastern
one    2000    Ohio  1.5   NaN   13     True
two    2001    Ohio  1.7  -1.2   13     True
three  2002    Ohio  3.6   NaN   13     True
four   2001  Nevada  2.4  -1.5   13    False
five   2002  Nevada  2.9  -1.7   13    False

Deleting a column

In [61]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'new'], dtype='object')

In [62]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [63]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [64]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [65]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [66]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [67]:
frame5 = pd.concat([frame4, frame4], axis=0)
frame5.iloc[3:,1] = 32
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4  32.0
2002     2.9  32.0
2000     2.0  32.0

In [68]:
frame5.drop_duplicates(['Nevada'], inplace=True)
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [69]:
dates = pd.date_range("20160101", periods=10, freq='D')
dates

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [70]:
data = np.random.random((10,3))

In [71]:
data

array([[0.82731679, 0.7230659 , 0.62091719],
       [0.23854105, 0.22102499, 0.58252865],
       [0.45331858, 0.69005725, 0.43608234],
       [0.93901457, 0.37188729, 0.23296001],
       [0.72412397, 0.73063597, 0.36712739],
       [0.08883792, 0.79874166, 0.0477268 ],
       [0.85586873, 0.77009668, 0.8599015 ],
       [0.26549842, 0.04670453, 0.6096778 ],
       [0.94059333, 0.68784594, 0.07959329],
       [0.82196578, 0.97171423, 0.8246879 ]])

In [72]:
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.827317  0.723066  0.620917
2016-01-02  0.238541  0.221025  0.582529
2016-01-03  0.453319  0.690057  0.436082
2016-01-04  0.939015  0.371887  0.232960
2016-01-05  0.724124  0.730636  0.367127
2016-01-06  0.088838  0.798742  0.047727
2016-01-07  0.855869  0.770097  0.859902
2016-01-08  0.265498  0.046705  0.609678
2016-01-09  0.940593  0.687846  0.079593
2016-01-10  0.821966  0.971714  0.824688

In [73]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.238541  0.221025  0.582529
2016-01-03  0.453319  0.690057  0.436082

In [74]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.939015  0.371887  0.232960
2016-01-05  0.724124  0.730636  0.367127
2016-01-06  0.088838  0.798742  0.047727
2016-01-07  0.855869  0.770097  0.859902

In [75]:
df.loc['2016-01-01':'2016-01-11','Column2']

2016-01-01    0.723066
2016-01-02    0.221025
2016-01-03    0.690057
2016-01-04    0.371887
2016-01-05    0.730636
2016-01-06    0.798742
2016-01-07    0.770097
2016-01-08    0.046705
2016-01-09    0.687846
2016-01-10    0.971714
Freq: D, Name: Column2, dtype: float64

In [76]:
df.iloc[0:11,1]

2016-01-01    0.723066
2016-01-02    0.221025
2016-01-03    0.690057
2016-01-04    0.371887
2016-01-05    0.730636
2016-01-06    0.798742
2016-01-07    0.770097
2016-01-08    0.046705
2016-01-09    0.687846
2016-01-10    0.971714
Freq: D, Name: Column2, dtype: float64

In [77]:
df[(df.index > '20160102') & (df.index < '20160106')]

             Column1   Column2   Column3
2016-01-03  0.453319  0.690057  0.436082
2016-01-04  0.939015  0.371887  0.232960
2016-01-05  0.724124  0.730636  0.367127

In [78]:
df.query('(Column1 < Column2) & (Column1 < Column3)')

             Column1   Column2   Column3
2016-01-10  0.821966  0.971714  0.824688

In [79]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.827317  0.620917
2016-01-02  0.238541  0.582529

In [80]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.939015  0.371887
2016-01-05  0.724124  0.730636

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2016-01-01 to 2016-01-10
Freq: D
Data columns (total 3 columns):
Column1    10 non-null float64
Column2    10 non-null float64
Column3    10 non-null float64
dtypes: float64(3)
memory usage: 640.0 bytes

In [82]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.615508   0.601177   0.466120
std     0.322437   0.289908   0.285049
min     0.088838   0.046705   0.047727
25%     0.312453   0.450877   0.266502
50%     0.773045   0.706562   0.509305
75%     0.848731   0.760232   0.618107
max     0.940593   0.971714   0.859902

In [83]:
df.sort_index(axis=0, ascending=True,) # inplace=True)

             Column1   Column2   Column3
2016-01-01  0.827317  0.723066  0.620917
2016-01-02  0.238541  0.221025  0.582529
2016-01-03  0.453319  0.690057  0.436082
2016-01-04  0.939015  0.371887  0.232960
2016-01-05  0.724124  0.730636  0.367127
2016-01-06  0.088838  0.798742  0.047727
2016-01-07  0.855869  0.770097  0.859902
2016-01-08  0.265498  0.046705  0.609678
2016-01-09  0.940593  0.687846  0.079593
2016-01-10  0.821966  0.971714  0.824688

In [84]:
df[sorted(df.columns)]

             Column1   Column2   Column3
2016-01-01  0.827317  0.723066  0.620917
2016-01-02  0.238541  0.221025  0.582529
2016-01-03  0.453319  0.690057  0.436082
2016-01-04  0.939015  0.371887  0.232960
2016-01-05  0.724124  0.730636  0.367127
2016-01-06  0.088838  0.798742  0.047727
2016-01-07  0.855869  0.770097  0.859902
2016-01-08  0.265498  0.046705  0.609678
2016-01-09  0.940593  0.687846  0.079593
2016-01-10  0.821966  0.971714  0.824688

In [85]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-08  0.265498  0.046705  0.609678
2016-01-02  0.238541  0.221025  0.582529
2016-01-04  0.939015  0.371887  0.232960
2016-01-09  0.940593  0.687846  0.079593
2016-01-03  0.453319  0.690057  0.436082
2016-01-01  0.827317  0.723066  0.620917
2016-01-05  0.724124  0.730636  0.367127
2016-01-07  0.855869  0.770097  0.859902
2016-01-06  0.088838  0.798742  0.047727
2016-01-10  0.821966  0.971714  0.824688

In [86]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160104", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [87]:
df1

             ColumnA   ColumnB
2016-01-01  0.659511  0.919600
2016-01-02  0.757473  0.484853
2016-01-03  0.684040  0.731057
2016-01-04  0.862720  0.181551
2016-01-05  0.352041  0.396304
2016-01-06  0.230627  0.429293

In [88]:
df2

             ColumnC   ColumnD
2016-01-04  0.634031  0.108127
2016-01-05  0.775373  0.072065
2016-01-06  0.497277  0.939777
2016-01-07  0.014647  0.252009
2016-01-08  0.652497  0.611883
2016-01-09  0.626166  0.196927
2016-01-10  0.289253  0.980970

In [89]:
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html
df1.join(df2, how='left')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.659511  0.919600       NaN       NaN
2016-01-02  0.757473  0.484853       NaN       NaN
2016-01-03  0.684040  0.731057       NaN       NaN
2016-01-04  0.862720  0.181551  0.634031  0.108127
2016-01-05  0.352041  0.396304  0.775373  0.072065
2016-01-06  0.230627  0.429293  0.497277  0.939777

In [90]:
df1.join(df2, how='right')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-04  0.862720  0.181551  0.634031  0.108127
2016-01-05  0.352041  0.396304  0.775373  0.072065
2016-01-06  0.230627  0.429293  0.497277  0.939777
2016-01-07       NaN       NaN  0.014647  0.252009
2016-01-08       NaN       NaN  0.652497  0.611883
2016-01-09       NaN       NaN  0.626166  0.196927
2016-01-10       NaN       NaN  0.289253  0.980970

In [91]:
df1.join(df2, how='outer')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.659511  0.919600       NaN       NaN
2016-01-02  0.757473  0.484853       NaN       NaN
2016-01-03  0.684040  0.731057       NaN       NaN
2016-01-04  0.862720  0.181551  0.634031  0.108127
2016-01-05  0.352041  0.396304  0.775373  0.072065
2016-01-06  0.230627  0.429293  0.497277  0.939777
2016-01-07       NaN       NaN  0.014647  0.252009
2016-01-08       NaN       NaN  0.652497  0.611883
2016-01-09       NaN       NaN  0.626166  0.196927
2016-01-10       NaN       NaN  0.289253  0.980970

In [92]:
df1.join(df2, how='inner')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-04  0.862720  0.181551  0.634031  0.108127
2016-01-05  0.352041  0.396304  0.775373  0.072065
2016-01-06  0.230627  0.429293  0.497277  0.939777

In [93]:
df2['ColumnA'] = df1.ColumnA+1   #Example when columns have the same name

df1.join(df2, how='left', rsuffix='_df2')

             ColumnA   ColumnB   ColumnC   ColumnD  ColumnA_df2
2016-01-01  0.659511  0.919600       NaN       NaN          NaN
2016-01-02  0.757473  0.484853       NaN       NaN          NaN
2016-01-03  0.684040  0.731057       NaN       NaN          NaN
2016-01-04  0.862720  0.181551  0.634031  0.108127     1.862720
2016-01-05  0.352041  0.396304  0.775373  0.072065     1.352041
2016-01-06  0.230627  0.429293  0.497277  0.939777     1.230627

In [94]:
del df2['ColumnA']
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Same', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Same', 
                               'Loss'], index=dates)

In [95]:
df3['Student'] = pd.Series(['Alex',
                            'Alex',
                            'Alex',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Barbara'], index=dates)

In [96]:
df3

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss Student
2016-01-01  0.659511  0.919600       NaN       NaN     Profit    Alex
2016-01-02  0.757473  0.484853       NaN       NaN       Loss    Alex
2016-01-03  0.684040  0.731057       NaN       NaN     Profit    Alex
2016-01-04  0.862720  0.181551  0.634031  0.108127       Same  Marcos
2016-01-05  0.352041  0.396304  0.775373  0.072065     Profit  Hannah
2016-01-06  0.230627  0.429293  0.497277  0.939777       Loss  Hannah

In [97]:
grupos = df3.groupby('ProfitLoss')#.mean()
grupos.mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.494050  0.457073  0.497277  0.939777
Profit      0.565197  0.682320  0.775373  0.072065
Same        0.862720  0.181551  0.634031  0.108127

Verifying Python's ordering heuristics

In [98]:
max(['name1', 'name2', 'Name3'])

'name2'

In [99]:
df4 = df3.groupby(['Student','ProfitLoss']).max()
df4

                     ColumnA   ColumnB   ColumnC   ColumnD
Student ProfitLoss
Alex    Loss        0.757473  0.484853       NaN       NaN
        Profit      0.684040  0.919600       NaN       NaN
Hannah  Loss        0.230627  0.429293  0.497277  0.939777
        Profit      0.352041  0.396304  0.775373  0.072065
Marcos  Same        0.862720  0.181551  0.634031  0.108127

In [100]:
df4.index.get_level_values('Student')

Index(['Alex', 'Alex', 'Hannah', 'Hannah', 'Marcos'], dtype='object', name='Student')

In [101]:
df4.loc[('Hannah','Profit'), 'ColumnA']

0.3520413883907285

### [Pandas Useful Functions](https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html)

In [102]:
df3

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss Student
2016-01-01  0.659511  0.919600       NaN       NaN     Profit    Alex
2016-01-02  0.757473  0.484853       NaN       NaN       Loss    Alex
2016-01-03  0.684040  0.731057       NaN       NaN     Profit    Alex
2016-01-04  0.862720  0.181551  0.634031  0.108127       Same  Marcos
2016-01-05  0.352041  0.396304  0.775373  0.072065     Profit  Hannah
2016-01-06  0.230627  0.429293  0.497277  0.939777       Loss  Hannah

### Transpose

In [103]:
df3.T

           2016-01-01 2016-01-02 2016-01-03 2016-01-04 2016-01-05 2016-01-06
ColumnA      0.659511   0.757473    0.68404    0.86272   0.352041   0.230627
ColumnB        0.9196   0.484853   0.731057   0.181551   0.396304   0.429293
ColumnC           NaN        NaN        NaN   0.634031   0.775373   0.497277
ColumnD           NaN        NaN        NaN   0.108127  0.0720649   0.939777
ProfitLoss     Profit       Loss     Profit       Same     Profit       Loss
Student          Alex       Alex       Alex     Marcos     Hannah     Hannah

In [104]:
df3.transpose()

           2016-01-01 2016-01-02 2016-01-03 2016-01-04 2016-01-05 2016-01-06
ColumnA      0.659511   0.757473    0.68404    0.86272   0.352041   0.230627
ColumnB        0.9196   0.484853   0.731057   0.181551   0.396304   0.429293
ColumnC           NaN        NaN        NaN   0.634031   0.775373   0.497277
ColumnD           NaN        NaN        NaN   0.108127  0.0720649   0.939777
ProfitLoss     Profit       Loss     Profit       Same     Profit       Loss
Student          Alex       Alex       Alex     Marcos     Hannah     Hannah

### [idmin & idmax](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.idxmax.html)

In [105]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-04 00:00:00', freq='D')

In [106]:
df3.loc[df3['ColumnA'].idxmax()]

ColumnA        0.86272
ColumnB       0.181551
ColumnC       0.634031
ColumnD       0.108127
ProfitLoss        Same
Student         Marcos
Name: 2016-01-04 00:00:00, dtype: object

In [107]:
max(df3['ColumnA'])

0.862719959623717

In [108]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-06 00:00:00', freq='D')

In [109]:
df3.loc[df3['ColumnA'].idxmin()]

ColumnA       0.230627
ColumnB       0.429293
ColumnC       0.497277
ColumnD       0.939777
ProfitLoss        Loss
Student         Hannah
Name: 2016-01-06 00:00:00, dtype: object

In [110]:
min(df3['ColumnA'])

0.23062677237732754

### [Not Equal - ne](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.ne.html)

In [111]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]

df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

### Nsmallest

In [112]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [113]:
df.nsmallest(3, 'x')

   x
0  0
1  0
2  0

### Nlargest

In [114]:
df['x'].nlargest(3)

12    7
11    6
10    5
Name: x, dtype: int64

In [115]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

### Is in

In [116]:
df.isin([0,2]).head(10)

       x
0   True
1   True
2   True
3   True
4   True
5   True
6  False
7   True
8  False
9  False

In [117]:
df[df.isin([0,2])] #.dropna()

      x
0   0.0
1   0.0
2   0.0
3   0.0
4   0.0
5   0.0
6   NaN
7   2.0
8   NaN
9   NaN
10  NaN
11  NaN
12  NaN

In [118]:
df[~df.isin([0,2])].dropna()

      x
6   1.0
8   3.0
9   4.0
10  5.0
11  6.0
12  7.0

In [119]:
# Create a test dataframe
# Untidy dataframe
# x : Subjects
# y : Student names

marks = pd.DataFrame(np.random.randint(0, 100, size = (20,5)), 
                     columns = ['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science'])

marks['Student'] = ['Student ' + str(i) for i in range(1,21)]
marks['Test'] = np.random.choice(['T1', 'T2', 'T3'], size=len(marks))
marks = marks[['Test','Student','Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science']]

display(marks.head())

  Test    Student  Maths  Physics  Chemistry  Biology  Computer_Science
0   T2  Student 1     28       50         33       73                31
1   T2  Student 2     54       44         42        7                76
2   T3  Student 3     93       46         68        9                71
3   T2  Student 4     81        5         36        9                88
4   T2  Student 5     91       28         65       49                 5

### [Agg](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html)

In [135]:
marks[['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science']].agg(['sum', 'min', 'mean'])

        Maths  Physics  Chemistry  Biology  Computer_Science
sum   1223.00    784.0    1047.00    808.0           1047.00
min     20.00      5.0       3.00      0.0              5.00
mean    61.15     39.2      52.35     40.4             52.35

### Group By

In [124]:
grouped = marks.groupby('Test')

In [125]:
for group in grouped:
    print(group[0])
    display(group[1].head())

T1

   Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
7    T1   Student 8     38        6         12       13                63
11   T1  Student 12     44       17         53        1                32
14   T1  Student 15     87       52         85       75                86
18   T1  Student 19     24       43          3       40                51

T2

   Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
0    T2   Student 1     28       50         33       73                31
1    T2   Student 2     54       44         42        7                76
3    T2   Student 4     81        5         36        9                88
4    T2   Student 5     91       28         65       49                 5
13   T2  Student 14     73       54         74       24                81

T3

  Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
2   T3   Student 3     93       46         68        9                71
5   T3   Student 6     86       16         49       85                57
6   T3   Student 7     30       41         42       93                18
8   T3   Student 9     20       58         46       31                34
9   T3  Student 10     71       96         96       73                17

In [126]:
grouped['Maths'].mean()

Test
T1    48.25
T2    69.25
T3    59.50
Name: Maths, dtype: float64

In [131]:
grouped2 = grouped.agg({"Student": "nunique"})
grouped2 = grouped2.reset_index()
print(grouped2)

  Test  Student
0   T1        4
1   T2        8
2   T3        8

### Pivot

In [120]:
pivot = marks.pivot(index='Test', columns='Student', values='Chemistry') 
pivot.head()

Student,Student 1,Student 10,Student 11,Student 12,Student 13,Student 14,Student 15,Student 16,Student 17,Student 18,Student 19,Student 2,Student 20,Student 3,Student 4,Student 5,Student 6,Student 7,Student 8,Student 9
Test,,,,,,,,,,,,,,,,,,,,
T1,NaN,NaN,NaN,53.0,NaN,NaN,85.0,NaN,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.0,NaN
T2,33.0,NaN,NaN,NaN,NaN,74.0,NaN,26.0,64.0,27.0,NaN,42.0,NaN,NaN,36.0,65.0,NaN,NaN,NaN,NaN
T3,NaN,96.0,36.0,NaN,98.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,92.0,68.0,NaN,NaN,49.0,42.0,NaN,46.0

### [Melt](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.melt.html)

In [121]:
marks.head(10)

  Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
0   T2   Student 1     28       50         33       73                31
1   T2   Student 2     54       44         42        7                76
2   T3   Student 3     93       46         68        9                71
3   T2   Student 4     81        5         36        9                88
4   T2   Student 5     91       28         65       49                 5
5   T3   Student 6     86       16         49       85                57
6   T3   Student 7     30       41         42       93                18
7   T1   Student 8     38        6         12       13                63
8   T3   Student 9     20       58         46       31                34
9   T3  Student 10     71       96         96       73                17

In [122]:
tidy = pd.melt(marks, id_vars = 'Student', value_name = 'Frequency')
tidy.tail(10)

        Student          variable Frequency
110  Student 11  Computer_Science        72
111  Student 12  Computer_Science        32
112  Student 13  Computer_Science        57
113  Student 14  Computer_Science        81
114  Student 15  Computer_Science        86
115  Student 16  Computer_Science        27
116  Student 17  Computer_Science        73
117  Student 18  Computer_Science        98
118  Student 19  Computer_Science        51
119  Student 20  Computer_Science        10

In [123]:
tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 3 columns):
Student      120 non-null object
variable     120 non-null object
Frequency    120 non-null object
dtypes: object(3)
memory usage: 2.9+ KB